Switch cisco para la VLAN 10 (Direcci贸n) y 100 (gesti贸n)
Interfaces que uso del switch VIRL Cisco: Gi0/0 - Gi0/1 - Gi0/2 - Gi1/0
Gi0/0 --> Trunk- conectado a Ether2 Mikrotik
Gi0/1 --> VLAN 10 - conectado a Equipo Direcci贸n
Gi0/2 --> VLAN 10 - conectado a Equipo Cap Estudis
Gi1/0 --> VLAN 100 - conectado a Equipo Gesti贸n de equipos


Switch>ena
Switch#conf t

Switch(config)#spanning-tree mode rapid-pvst
Switch(config)#spanning-tree extend system-id     
Switch(config)#vlan internal allocation policy ascending

#Nombrado de las VLAN
Switch(config)#vlan 10
Switch(config-vlan)#name Direccio
Switch(config-vlan)#exit

Switch(config)#vlan 100
Switch(config-vlan)#name Gestio
Switch(config-vlan)#exit


#Interfaz trunk
Switch(config)#interface Gi0/0
Switch(config-if)#switchport trunk encapsulation dot1q
Switch(config-if)#switchport mode trunk
Switch(config-if)#media-type rj45
Switch(config-if)#negotiation auto
Switch(config-if)#exit

#Interfaz PC Direccio
#switchport protected -->
  #El puerto protected no se comunica con otros puertos protected pero se comunica con otros puertos no protected. 
  #Para que un puerto protected se comunique con otro puerto protected, se utiliza una puerta de enlace predeterminada (capa 3).

Switch(config)#interface Gi0/1
Switch(config-if)#switchport access vlan 10
Switch(config-if)#switchport mode access
Switch(config-if)#switchport protected
Switch(config-if)#media-type rj45
Switch(config-if)#negotiation auto
Switch(config-if)#exit

#Interfaz PC CapEstudis
Switch(config)#interface Gi0/2
Switch(config-if)#switchport access vlan 10
Switch(config-if)#switchport mode access
Switch(config-if)#switchport protected
Switch(config-if)#media-type rj45
Switch(config-if)#negotiation auto
Switch(config-if)#exit

#Interfaz PC Coordinador TIC - Gestio    
Switch(config)#interface Gi1/0
Switch(config-if)#switchport access vlan 100
Switch(config-if)#switchport mode access
Switch(config-if)#switchport protected
Switch(config-if)#media-type rj45
Switch(config-if)#negotiation auto
Switch(config-if)#exit

#Guardar los cambios
copy running-config startup-config
