#Switch cisco para la VLAN 10 (Dirección) y 100 (gestión)
#Interfaces que se usan del switch VIRL Cisco: Gi0/0 - Gi0/1 - Gi0/2 - Gi1/0
Gi0/0 --> Trunk- conectado a Ether2 Mikrotik
Gi0/1 --> VLAN 10 - conectado a Equipo Dirección
Gi0/2 --> VLAN 10 - conectado a Equipo Jefatura de Estudios Estudis
Gi1/0 --> VLAN 100 - conectado a Equipo Gestión de equipos


Switch>ena
Switch#conf t

Switch(config)#spanning-tree mode rapid-pvst
Switch(config)#spanning-tree extend system-id     
Switch(config)#vlan internal allocation policy ascending

#Nombrado de las VLAN
Switch(config)#vlan 10
Switch(config-vlan)#name Direccion
Switch(config-vlan)#exit

Switch(config)#vlan 100
Switch(config-vlan)#name Gestion
Switch(config-vlan)#exit


#Interfaz trunk
Switch(config)#interface Gi0/0
Switch(config-if)#switchport trunk encapsulation dot1q
Switch(config-if)#switchport mode trunk
Switch(config-if)#media-type rj45
Switch(config-if)#negotiation auto
Switch(config-if)#exit

#Interfaz PC Direccion
#switchport protected -->
  #El puerto protected no se comunica con otros puertos protected pero se comunica con otros puertos no protected. 
  #Para que un puerto protected se comunique con otro puerto protected, se utiliza una puerta de enlace predeterminada (capa 3).

Switch(config)#interface Gi0/1
Switch(config-if)#switchport access vlan 10
Switch(config-if)#switchport mode access
Switch(config-if)#switchport protected
Switch(config-if)#media-type rj45
Switch(config-if)#negotiation auto
Switch(config-if)#exit

#Interfaz PC CapEstudis
Switch(config)#interface Gi0/2
Switch(config-if)#switchport access vlan 10
Switch(config-if)#switchport mode access
Switch(config-if)#switchport protected
Switch(config-if)#media-type rj45
Switch(config-if)#negotiation auto
Switch(config-if)#exit

#Interfaz PC Coordinador TIC - Gestion    
Switch(config)#interface Gi1/0
Switch(config-if)#switchport access vlan 100
Switch(config-if)#switchport mode access
Switch(config-if)#switchport protected
Switch(config-if)#media-type rj45
Switch(config-if)#negotiation auto
Switch(config-if)#exit

#Configurar la ip del switch
Switch# configure terminal
Switch(config)# interface vlan 100
Switch(config-if)# ip address 192.168.100.103 255.255.255.0
Switch(config-if)# no shutdown
Switch(config-if)# exit
Switch(config)# ip default-gateway 192.168.100.1

#Para configurar una contraseña de acceso por consola, de modo que se solicite nada más conectarse a través de una sesión de terminal:
Switch(config)#line console 0
Switch(config-line)#password xxxxxx

#Guardar los cambios
Switch#copy running-config startup-config
